app/views/books/show.html.erb

          <td id="comment_count_<%= @book.id %>">
            コメント数：<%= @book.book_comments.count %>
---
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 3]]