app/controllers/books_controller.rb

SELECT COUNT(*) FROM "books" WHERE (created_at > '2021-06-03 00:00:00') AND (created_at < '2021-06-09 06:19:05.109177')
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ? AND (created_at > '2021-06-02')  [["book_id", 2]]
---
  def index
    @book = Book.new
    case sort_params[:sort]
    when 'date'
      @books = Book.sort_desc_by_date
    when 'rate'
      @books = Book.sort_desc_by_rate
    else
      one_week_ago = Date.today - 7       # 直近のいいね 数の多さで並べ替えるときの記述
      @books = Book.all.sort {|a,b| b.favorites.where("created_at > ?", one_week_ago).size <=> a.favorites.where("created_at > ?", one_week_ago).size}

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at", "rate", "category") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "健康"], ["body", "台紙"], ["user_id", 3], ["created_at", "2021-06-10 13:22:13.698304"], ["updated_at", "2021-06-10 13:22:13.698304"], ["rate", 4.5], ["category", "食事"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      redirect_to book_path(@book), notice: "You have created book successfully."
    else
      @books = Book.all