app/controllers/books_controller.rb

  def show
    @book = Book.find(params[:id])
    @new_book = Book.new
    @book_comment = BookComment.new

    # 作成日時で分類するために自分で作ったコード。15行と長い。
    now = Time.current
    from = now.at_beginning_of_day
    to = from + 1.day
    yesterday = now.yesterday.at_beginning_of_day
    this_week = from - 6.day
    last_week = this_week - 7.day
    @book_today = Book.where("created_at > ?", from ).where("created_at < ?", to ).size
---
SELECT COUNT(*) FROM "books" WHERE (created_at > '2021-06-09 00:00:00') AND (created_at < '2021-06-10 00:00:00')

  def index
    @book = Book.new
    @books = Book.all
---
SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC