app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @books = @user.books
    @book = Book.new
    @relationship = current_user.relationships.new

    @today_book =  @books.created_today
    @yesterday_book = @books.created_yesterday
    @this_week_book = @books.created_this_week
    @last_week_book = @books.created_last_week

    # グラフ化のための変数
    @book_by_day = @books.group_by_day(:created_at).size #日毎の投稿データをグルーピング。ハッシュの形式になっている
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."user_id" = ? AND "books"."created_at" BETWEEN ? AND ? LIMIT ?  [["user_id", 3], ["created_at", "2021-06-10 00:00:00"], ["created_at", "2021-06-10 23:59:59.999999"], ["LIMIT", 11]]
SELECT COUNT(*) AS count_all, strftime('%Y-%m-%d 00:00:00 UTC', "books"."created_at") AS strftime_y_m_d_00_00_00_utc_books_created_at FROM "books" WHERE "books"."user_id" = ? AND ("books"."created_at" IS NOT NULL) GROUP BY strftime('%Y-%m-%d 00:00:00 UTC', "books"."created_at")  [["user_id", 3]]